In [1]:
import numpy as np
import pandas as pd

# Operations

In [4]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df['col2'].unique()
# df['col2'].nunique() return no of unique values

array([444, 555, 666])

In [8]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [9]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [10]:
def times2(x):
    return x*2

In [11]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [14]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [15]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [17]:
# df.drop('col1', axis=1)
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [19]:
# sort
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [20]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

## PIVOT TABLES

In [24]:
df.pivot_table(values='D', index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [23]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# DATA INPUT AND OUTPUT
    
    - CSV
    - Excel
    - HTML
    - SQL

In [25]:
import pandas as pd

## CSV

In [26]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [27]:
df = pd.read_csv('example')

df.to_csv('output_example.csv', index=False)

## Excel

In [30]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [31]:
df.to_excel('excel_sample.xlsx', sheet_name='NewSheeet')

## HTML

In [33]:
# df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

## SQL

In [39]:
# db = '/Users/4bic/projects/data_school/mega_applications/oop_bookstore/books.db'
db = '/Users/4bic/projects/data_school/mega_applications/databases/lite.db'

db

'/Users/4bic/projects/data_school/mega_applications/databases/lite.db'

In [41]:
from sqlalchemy import create_engine

engine = create_engine('sqlite:///:memory:')

In [42]:
df.to_sql('my_Table', engine)

In [44]:
sqldf = pd.read_sql('my_Table', con=engine)

sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [46]:
pd.read_sql('lite.db',con=engine)

OperationalError: (sqlite3.OperationalError) near "lite": syntax error [SQL: 'lite.db']